vcr_cassettes/capture_multi_payment_sucess.yml

---
http_interactions:
- request:
    method: post
    uri: https://01010101010101010101010101010101:ABABABABABABABABABABABABABABABABABABABAB@sandbox.moip.com.br/v2/multipayments/MPY-89Q4R26EKU9D/capture
    body:
      encoding: UTF-8
      string: '{}'
    headers:
      Content-Type:
      - application/json
      User-Agent:
      - MoipRubySDK/1.0.0 (+https://github.com/moip/moip-sdk-ruby)
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 02 Oct 2017 13:42:53 GMT
      Server:
      - Apache
      Status:
      - 200 OK
      X-Newrelic-App-Data:
      - PxQFUlBXAQoTUVFWDgEDUVYTGhE1AwE2QgNWEVlbQFtcC2VOYwRAFjNTVTIDEU5aUwE9TUEDa0kJRFpHCxYCG10HVhZLZBtJWgFEPR4CUhIQQ0UERktofGMwSEAbARlWSAEYBlBeVFMGVw5OChQWVAIBAQIAWFdQVFdRV1IFDxEcAgAORFRq
      Content-Type:
      - application/json
      Content-Length:
      - '2982'
      X-Content-Type-Options:
      - nosniff
      Vary:
      - Accept-Encoding,Origin
    body:
      encoding: UTF-8
      string: '{"id":"MPY-89Q4R26EKU9D","status":"AUTHORIZED","amount":{"total":8000,"gross":8000,"currency":"BRL"},"installmentCount":1,"payments":[{"id":"PAY-6S0IF4DBW3T7","status":"AUTHORIZED","delayCapture":true,"amount":{"total":4000,"gross":4000,"fees":289,"refunds":0,"liquid":3711,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-0DWSR8500SWI","brand":"VISA","first6":"401200","last4":"3335","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose
        Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":289}],"events":[{"type":"PAYMENT.AUTHORIZED","createdAt":"2017-10-02T10:42:53.258-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-10-02T10:16:12.000-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-10-02T10:16:12.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-10-02T10:16:12.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-10-02T10:16:12.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-1DD377B1D8FB","login":"dev.moip.1455@labs.moip.com.br","fullname":"Joaquim
        Silva Silva"},"type":"PRIMARY","amount":{"total":4000,"refunds":0}}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-6S0IF4DBW3T7"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-1M7GQKVQVQ9M","title":"ORD-1M7GQKVQVQ9M"}},"createdAt":"2017-10-02T10:16:12.000-03","updatedAt":"2017-10-02T10:42:53.257-03"},{"id":"PAY-DX3FGEG2EGO4","status":"AUTHORIZED","delayCapture":true,"amount":{"total":4000,"gross":4000,"fees":289,"refunds":0,"liquid":3711,"currency":"BRL"},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-0DWSR8500SWI","brand":"VISA","first6":"401200","last4":"3335","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose
        Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":289}],"events":[{"type":"PAYMENT.AUTHORIZED","createdAt":"2017-10-02T10:42:53.259-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-10-02T10:16:12.000-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-10-02T10:16:12.000-03"},{"type":"PAYMENT.WAITING","createdAt":"2017-10-02T10:16:12.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-10-02T10:16:12.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-1DD377B1D8FB","login":"dev.moip.1455@labs.moip.com.br","fullname":"Joaquim
        Silva Silva"},"type":"PRIMARY","amount":{"total":4000,"refunds":0}}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-DX3FGEG2EGO4"},"order":{"href":"https://sandbox.moip.com.br/v2/orders/ORD-0M4AWO4315VK","title":"ORD-0M4AWO4315VK"}},"createdAt":"2017-10-02T10:16:12.000-03","updatedAt":"2017-10-02T10:42:53.258-03"}],"_links":{"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-89Q4R26EKU9D"},"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-WIJ5E6J7VERW"}}}'
    http_version: 
  recorded_at: Mon, 02 Oct 2017 13:42:53 GMT
recorded_with: VCR 2.9.3
