vcr_cassettes/create_multi_payment_success.yml

---
http_interactions:
- request:
    method: post
    uri: https://01010101010101010101010101010101:ABABABABABABABABABABABABABABABABABABABAB@sandbox.moip.com.br/v2/multiorders/MOR-IVKZDU55LXJU/multipayments
    body:
      encoding: UTF-8
      string: '{"installmentCount":1,"fundingInstrument":{"method":"CREDIT_CARD","creditCard":{"expirationMonth":5,"expirationYear":18,"number":"4012001038443335","cvc":"123","holder":{"fullname":"Jose
        Portador da Silva","birthdate":"1988-12-30","taxDocument":{"type":"CPF","number":"33333333333"},"phone":{"countryCode":"55","areaCode":"11","number":"66778899"}}}}}'
    headers:
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - nginx
      Date:
      - Fri, 27 Feb 2015 21:16:02 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1982'
      Connection:
      - keep-alive
      Status:
      - 201 Created
      X-Newrelic-App-Data:
      - PxQFUlBXAQoTV1VaDgIEV0YdFGQHBDcQUQxLA1tMXV1dORYzVBJHNQFUZAQUFVFQVThOFAVtGAsRXUJaDRQHB0IRZE1DV0ZWVhdwBUw9HA8RWkMIFgJBXlUKFREXGWcpN2UfEU5WTVIcUBZVDgkNBQVSFVIEUB9AXQEOVVECDlIIXVVQBwlSX0Zs
      Vary:
      - Accept-Encoding
      X-Content-Type-Options:
      - nosniff
    body:
      encoding: UTF-8
      string: '{"id":"MPY-DSA3I67FOKES","status":"WAITING","amount":{"currency":"BRL","total":8000},"installmentCount":1,"payments":[{"id":"PAY-T3YDOW7IPAML","status":"WAITING","amount":{"fees":335,"refunds":0,"liquid":3665,"currency":"BRL","total":4000},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-AQY93MP1MBPX","brand":"VISA","first6":"401200","last4":"3335","holder":{"birthdate":"30/12/1988","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose
        Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":335}],"events":[{"createdAt":"2015-02-27T18:16:02-0300","type":"PAYMENT.WAITING"},{"createdAt":"2015-02-27T18:16:00-0300","type":"PAYMENT.CREATED"}],"_links":{"order":{"title":"ORD-TLEDJRICCU8E","href":"https://sandbox.moip.com.br/v2/orders/ORD-TLEDJRICCU8E"},"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-T3YDOW7IPAML"}},"createdAt":"2015-02-27T18:16:00-0300","updatedAt":"2015-02-27T18:16:02-0300"},{"id":"PAY-TDN29LCT376R","status":"WAITING","amount":{"fees":335,"refunds":0,"liquid":3665,"currency":"BRL","total":4000},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-J2IQXSTS2Z9O","brand":"VISA","first6":"401200","last4":"3335","holder":{"birthdate":"30/12/1988","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose
        Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":335}],"events":[{"createdAt":"2015-02-27T18:16:02-0300","type":"PAYMENT.WAITING"},{"createdAt":"2015-02-27T18:16:01-0300","type":"PAYMENT.CREATED"}],"_links":{"order":{"title":"ORD-25B02M8CTKOF","href":"https://sandbox.moip.com.br/v2/orders/ORD-25B02M8CTKOF"},"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-TDN29LCT376R"}},"createdAt":"2015-02-27T18:16:01-0300","updatedAt":"2015-02-27T18:16:02-0300"}],"_links":{"multiorder":{"href":"https://sandbox.moip.com.br/v2/multiorders/MOR-IVKZDU55LXJU"},"self":{"href":"https://sandbox.moip.com.br/v2/multipayments/MPY-DSA3I67FOKES"}}}'
    http_version: 
  recorded_at: Fri, 27 Feb 2015 21:16:01 GMT
recorded_with: VCR 2.9.3
