vcr_cassettes/show_multi_payment.yml

---
http_interactions:
- request:
    method: get
    uri: https://01010101010101010101010101010101:ABABABABABABABABABABABABABABABABABABABAB@test.moip.com.br/v2/multipayments/MPY-DSA3I67FOKES
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 27 Feb 2015 21:24:36 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2269'
      Connection:
      - keep-alive
      Status:
      - 200 OK
      X-Newrelic-App-Data:
      - PxQFUlBXAQoTV1VaDgIEV0YdFGQHBDcQUQxLA1tMXV1dORYzVBJHNQFUZAQUFVFQVThOFAVtGAsRXUJaEgcaD1UMTBFkF09fRglNCGEASg8BWEMoAh4YG3chNUsVHQdIVB0GHVBSV1cFVwxWFAgYEAoBCAQDWAUAUAAFWVFSXQsSOQ==
      Vary:
      - Accept-Encoding
      X-Content-Type-Options:
      - nosniff
    body:
      encoding: UTF-8
      string: '{"id":"MPY-DSA3I67FOKES","status":"AUTHORIZED","amount":{"currency":"BRL","total":8000},"installmentCount":1,"payments":[{"id":"PAY-T3YDOW7IPAML","status":"AUTHORIZED","amount":{"fees":335,"refunds":0,"liquid":3665,"currency":"BRL","total":4000},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-AQY93MP1MBPX","brand":"VISA","first6":"401200","last4":"3335","holder":{"birthdate":"30/12/1988","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose
        Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":335}],"events":[{"createdAt":"2015-02-27T18:16:08-0300","type":"PAYMENT.AUTHORIZED"},{"createdAt":"2015-02-27T18:16:05-0300","type":"PAYMENT.IN_ANALYSIS"},{"createdAt":"2015-02-27T18:16:02-0300","type":"PAYMENT.WAITING"},{"createdAt":"2015-02-27T18:16:00-0300","type":"PAYMENT.CREATED"}],"_links":{"order":{"title":"ORD-TLEDJRICCU8E","href":"https://test.moip.com.br/v2/orders/ORD-TLEDJRICCU8E"},"self":{"href":"https://test.moip.com.br/v2/payments/PAY-T3YDOW7IPAML"}},"createdAt":"2015-02-27T18:16:00-0300","updatedAt":"2015-02-27T18:16:08-0300"},{"id":"PAY-TDN29LCT376R","status":"AUTHORIZED","amount":{"fees":335,"refunds":0,"liquid":3665,"currency":"BRL","total":4000},"installmentCount":1,"fundingInstrument":{"creditCard":{"id":"CRC-J2IQXSTS2Z9O","brand":"VISA","first6":"401200","last4":"3335","holder":{"birthdate":"30/12/1988","taxDocument":{"type":"CPF","number":"33333333333"},"fullname":"Jose
        Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":335}],"events":[{"createdAt":"2015-02-27T18:16:08-0300","type":"PAYMENT.AUTHORIZED"},{"createdAt":"2015-02-27T18:16:05-0300","type":"PAYMENT.IN_ANALYSIS"},{"createdAt":"2015-02-27T18:16:02-0300","type":"PAYMENT.WAITING"},{"createdAt":"2015-02-27T18:16:01-0300","type":"PAYMENT.CREATED"}],"_links":{"order":{"title":"ORD-25B02M8CTKOF","href":"https://test.moip.com.br/v2/orders/ORD-25B02M8CTKOF"},"self":{"href":"https://test.moip.com.br/v2/payments/PAY-TDN29LCT376R"}},"createdAt":"2015-02-27T18:16:01-0300","updatedAt":"2015-02-27T18:16:08-0300"}],"_links":{"multiorder":{"href":"https://test.moip.com.br/v2/multiorders/MOR-IVKZDU55LXJU"},"self":{"href":"https://test.moip.com.br/v2/multipayments/MPY-DSA3I67FOKES"}}}'
    http_version: 
  recorded_at: Fri, 27 Feb 2015 21:24:35 GMT
recorded_with: VCR 2.9.3
